; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image6 - mode
	infrared5 - mode
	spectrograph4 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	infrared2 - mode
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star8 - direction
	Star11 - direction
	GroundStation13 - direction
	Star10 - direction
	GroundStation0 - direction
	Star3 - direction
	Star9 - direction
	Star7 - direction
	Star12 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image6)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star7)
	(supports instrument2 image6)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star12)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Phenomenon14 thermograph3)
	(have_image Star15 spectrograph4)
	(have_image Star15 image1)
	(have_image Phenomenon16 image6)
	(have_image Phenomenon17 spectrograph4)
	(have_image Phenomenon17 image1)
))

)

; plan
1. (turn_to satellite0 phenomenon14 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 7
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation0 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
4. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 7
5. (turn_to satellite0 phenomenon16 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 7
6. (take_image satellite0 phenomenon16 instrument2 image6)
   added: (have_image phenomenon16 image6)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation0 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 7
8. (turn_to satellite0 phenomenon17 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 7
9. (take_image satellite0 phenomenon17 instrument2 spectrograph4)
   added: (have_image phenomenon17 spectrograph4)
   goals met: 2 of 7
10. (turn_to satellite0 star15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star15)
   goals met: 2 of 7
11. (take_image satellite0 star15 instrument2 spectrograph4)
   added: (have_image star15 spectrograph4)
   goals met: 3 of 7
12. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 7
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
14. (turn_to satellite0 star9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star9)
   goals met: 3 of 7
15. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 3 of 7
16. (turn_to satellite0 phenomenon14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 7
17. (take_image satellite0 phenomenon14 instrument0 thermograph3)
   added: (have_image phenomenon14 thermograph3)
   goals met: 4 of 7
18. (turn_to satellite0 phenomenon17 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon17)
   goals met: 4 of 7
19. (take_image satellite0 phenomenon17 instrument0 image1)
   added: (have_image phenomenon17 image1)
   goals met: 5 of 7
20. (turn_to satellite0 star15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star15)
   goals met: 5 of 7
21. (take_image satellite0 star15 instrument0 image1)
   added: (have_image star15 image1)
   goals met: 6 of 7
22. (turn_to satellite0 star7 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star7)
   goals met: 7 of 7
